
<h2 id="Pandas">Pandas<a class="anchor-link" href="#Pandas">¶</a></h2><p>Pandas is one of the most important Python library built on top of NumPy used for data manipulation. Unlike, NumPy, Pandas is designed for working with tabular or heterogenous data. The two main data structures of Pandas is</p>
<ul>
<li><strong>Series</strong> - 1D labeled homogeneous array, size immutable.</li>
<li><strong>DataFrame</strong> - 2D labeled, size-mutable tabular structure with potentially heterogeneously typed columns.</li>
</ul>


<h3 id="Installation">Installation<a class="anchor-link" href="#Installation">¶</a></h3>


<p>We'll install the required libraries that we'll use in this example.</p>

In [1]:
# Instal Pandas library
# ! pip install pandas


<h3 id="Importing">Importing<a class="anchor-link" href="#Importing">¶</a></h3><p>We'll import the required libraries that we'll use in this example.</p>

In [2]:
# Import required libraries
import pandas as pd
import numpy as np

In [3]:
# Check the version
pd.__version__

'0.24.2'


<h2 id="Data-Structure">Data Structure<a class="anchor-link" href="#Data-Structure">¶</a></h2>


<h3 id="Series">Series<a class="anchor-link" href="#Series">¶</a></h3><p>Pandas Series is a one-dimensional labeled array capable of holding data on any type such as integer, string, float, python objects, etc., The axis labels are collectively called index.</p>
<p>A series can be created using <code>array</code>, <code>dict</code> and <code>scalar value</code>.</p>

In [4]:
# Create an Empty Series
s = pd.Series(dtype = float)
print(s)

Series([], dtype: float64)

In [5]:
# Create a Series from ndarray
s = np.arange(10,20)
pd.Series(s)

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int64

In [6]:
# Create a Series from dict
s = {'a' : 0., 'b' : 1., 'c' : 2.}
pd.Series(s)

a    0.0
b    1.0
c    2.0
dtype: float64

In [7]:
# Create a Series from Scalar
pd.Series(123, index=[0, 1, 2, 3])

0    123
1    123
2    123
3    123
dtype: int64


<h3 id="DataFrame">DataFrame<a class="anchor-link" href="#DataFrame">¶</a></h3><p>A DataFrame is a two-dimensional, size-mutuable, heterogenous tabular data with labeled axes where arithmetic operations align on both row and column labels.</p>
<p>A pandas DataFrame can be created using <code>lists</code>, <code>dict</code>, <code>Series</code>, <code>ndarrays</code> and <code>Another DataFrame</code>.</p>

In [8]:
# Create an Empty DataFrame
df = pd.DataFrame()
print (df)

Empty DataFrame
Columns: []
Index: []

In [9]:
# Create a DataFrame from Lists
data = [['Program','CQF'],['Module', 1],['School', 'Fitch'], ['City', 'London'], ['Country', 'UK']]
df = pd.DataFrame(data, columns=['Name', 'Details'])
df

      Name Details
0  Program     CQF
1   Module       1
2   School   Fitch
3     City  London
4  Country      UK

In [10]:
# Create a DataFrame from Dictionary
data = {'Name': ['Program', 'Module', 'School', 'City', 'Country'],
           'Details': ['CQF', 1, 'Fitch', 'London', 'UK']}
df = pd.DataFrame(data)
df

      Name Details
0  Program     CQF
1   Module       1
2   School   Fitch
3     City  London
4  Country      UK

In [11]:
# Create a DataFrame from Series
data = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
        'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(data)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [12]:
# Create a DataFrame from NumPy arrays
data = np.ones((3,4))
df = pd.DataFrame(data)
df

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0

In [13]:
# Create a DataFrame from another DataFrame
df = pd.DataFrame(df.iloc[:,0])
df

     0
0  1.0
1  1.0
2  1.0


<h2 id="Indexing-&amp;-Selection">Indexing &amp; Selection<a class="anchor-link" href="#Indexing-&amp;-Selection">¶</a></h2>


<h3 id="Indexers:-loc,-iloc">Indexers: loc, iloc<a class="anchor-link" href="#Indexers:-loc,-iloc">¶</a></h3><p>Pandas has special indexing operators <code>loc</code> and <code>iloc</code> that enables us to selection a subset of rows and columns. The basics of indexing are as follows:</p>
<table>
<thead><tr>
<th>Operation</th>
<th>Syntax</th>
<th>Result</th>
</tr>
</thead>
<tbody>
<tr>
<td>Select column</td>
<td>df[col]</td>
<td>Series</td>
</tr>
<tr>
<td>Select row by label</td>
<td>df.loc[label]</td>
<td>Series</td>
</tr>
<tr>
<td>Select row by integer location</td>
<td>df.iloc[loc]</td>
<td>Series</td>
</tr>
<tr>
<td>Slice rows</td>
<td>df[2:5]</td>
<td>DataFrame</td>
</tr>
</tbody>
</table>


<h3 id="Data-Selection-in-Series">Data Selection in Series<a class="anchor-link" href="#Data-Selection-in-Series">¶</a></h3><p>Data in Series can be accessed similar to that in an ndarray, and in many ways like a standard Python dictionary.</p>

In [16]:
# Selection from Series
s = pd.Series(np.arange(10,20))

print(f'First Element in a Series: {s[0]}')  # first element
print(f'First Three Element in a Series: {s[:3]}')  # first three elements

First Element in a Series: 10
First Three Element in a Series: 0    10
1    11
2    12
dtype: int64

In [15]:
s.loc[1]

11

In [17]:
# Selection from Series as dictionary
s = pd.Series({'a' : 0., 'b' : 1., 'c' : 2.})
s['a'], s['c']

(0.0, 2.0)


<h3 id="DataFrame-Column-Selection">DataFrame Column Selection<a class="anchor-link" href="#DataFrame-Column-Selection">¶</a></h3>

In [18]:
# Column selection from DataFrame o
data = {'Name': ['Program', 'Module', 'School', 'City', 'Country'],
           'Details': ['CQF', 1, 'Fitch', 'London', 'UK']}

df = pd.DataFrame(data,  index = ['a','b','c','d','e'])
df['Name']

a    Program
b     Module
c     School
d       City
e    Country
Name: Name, dtype: object

In [19]:
df.loc['d']

Name         City
Details    London
Name: d, dtype: object

In [20]:
df.iloc[2]

Name       School
Details     Fitch
Name: c, dtype: object

In [21]:
df.iloc[4]

Name       Country
Details         UK
Name: e, dtype: object

In [22]:
df[2:4]

     Name Details
c  School   Fitch
d    City  London


<h2 id="Essential-Functionality">Essential Functionality<a class="anchor-link" href="#Essential-Functionality">¶</a></h2><p>We'll now see some of the essential functionality common to the Pandas data structures.</p>

In [24]:
df = pd.DataFrame(np.arange(1,21), columns=['Numeric'])
df

    Numeric
0         1
1         2
2         3
3         4
4         5
5         6
6         7
7         8
8         9
9        10
10       11
11       12
12       13
13       14
14       15
15       16
16       17
17       18
18       19
19       20


<p>To view a small sample of a Series or DataFrame object, use the head() and tail() methods. The default number of elements to display is five, but you may pass a custom number.</p>

In [25]:
# First five values
df.head()

   Numeric
0        1
1        2
2        3
3        4
4        5

In [26]:
# Last five values
df.tail()

    Numeric
15       16
16       17
17       18
18       19
19       20

In [27]:
# DataFrame index object
df.index

RangeIndex(start=0, stop=20, step=1)

In [28]:
# Metadata
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 1 columns):
Numeric    20 non-null int64
dtypes: int64(1)
memory usage: 240.0 bytes

In [29]:
# Tuple representing the dimension of the DataFrame
df.shape

(20, 1)

In [30]:
# NumPy representation of NDFrame
df.values

array([[ 1],
       [ 2],
       [ 3],
       [ 4],
       [ 5],
       [ 6],
       [ 7],
       [ 8],
       [ 9],
       [10],
       [11],
       [12],
       [13],
       [14],
       [15],
       [16],
       [17],
       [18],
       [19],
       [20]])


<h2 id="Descriptive-Statistics">Descriptive Statistics<a class="anchor-link" href="#Descriptive-Statistics">¶</a></h2><p>Pandas objects are equipped with common mathematical and statistical methods. A large number of methods collectively compute descriptive statistics and other related operations on DataFrame. Unlike NumPy, Pandas methods can handle missing data.</p>

In [31]:
# Sum
print(f'Sum                : {df.sum()[0]}')
print(f'Mean               : {df.mean()[0]}')
print(f'Median             : {df.median()[0]}')
print(f'Standard deviation : {df.std()[0]:.2f}')
print(f'Minimum            : {df.min()[0]}')
print(f'Maximum            : {df.max()[0]}')
print(f'Index of Minimum   : {df.idxmin()[0]}')
print(f'Index of Maximum   : {df.idxmax()[0]}')

Sum                : 210
Mean               : 10.5
Median             : 10.5
Standard deviation : 5.92
Minimum            : 1
Maximum            : 20
Index of Minimum   : 0
Index of Maximum   : 19

In [32]:
# Cumulative Sum
df.cumsum().iloc[-1]

Numeric    210
Name: 19, dtype: int64

In [33]:
# Cumulative Product
df.cumprod().iloc[-1]

Numeric    2432902008176640000
Name: 19, dtype: int64

In [34]:
# Summary Statistics 
df.describe().T

         count  mean      std  min   25%   50%    75%   max
Numeric   20.0  10.5  5.91608  1.0  5.75  10.5  15.25  20.0


<pre><code>                           List of key aggregation functions available in Pandas

</code></pre>
<table>
<thead><tr>
<th>Aggregation</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>count()</code></td>
<td>Total number of items</td>
</tr>
<tr>
<td><code>first()</code>, <code>last()</code></td>
<td>First and last item</td>
</tr>
<tr>
<td><code>mean()</code>, <code>median()</code></td>
<td>Mean and median</td>
</tr>
<tr>
<td><code>min()</code>, <code>max()</code></td>
<td>Minimum and maximum</td>
</tr>
<tr>
<td><code>std()</code>, <code>var()</code></td>
<td>Standard deviation and variance</td>
</tr>
<tr>
<td><code>mad()</code></td>
<td>Mean absolute deviation</td>
</tr>
<tr>
<td><code>prod</code></td>
<td>Product of all items</td>
</tr>
<tr>
<td><code>sum</code></td>
<td>Sum of all items</td>
</tr>
</tbody>
</table>

In [36]:
# Sort by Index
s = pd.Series(np.arange(1,6), index=['e', 'a', 'c', 'b', 'd'])
s.sort_index()

a    2
b    4
c    3
d    5
e    1
dtype: int64

In [37]:
# Sort by values
s.sort_values()

e    1
a    2
c    3
b    4
d    5
dtype: int64

In [38]:
np.random.seed(0)
df = pd.DataFrame(np.arange(10).reshape(2,5), index=['two', 'one'], columns=['d', 'e', 'a', 'c', 'b'])
df

     d  e  a  c  b
two  0  1  2  3  4
one  5  6  7  8  9

In [39]:
# Sort DataFrame by index column
df.sort_index(axis=1)

     a  b  c  d  e
two  2  4  3  0  1
one  7  9  8  5  6

In [40]:
# Sort DataFrame by index
df.sort_index(axis=1, ascending=False)

     e  d  c  b  a
two  1  0  3  4  2
one  6  5  8  9  7

In [41]:
dd = pd.DataFrame({'col1':[2,1,1,1],'col2':[1,3,2,4]})
dd

   col1  col2
0     2     1
1     1     3
2     1     2
3     1     4

In [42]:
# Sort DataFrame by values
dd.sort_values( by=['col1', 'col2'])

   col1  col2
2     1     2
1     1     3
3     1     4
0     2     1


<h2 id="Aggregation">Aggregation<a class="anchor-link" href="#Aggregation">¶</a></h2><h3 id="GroupBy">GroupBy<a class="anchor-link" href="#GroupBy">¶</a></h3><p>Groupby object is a flexbible abstraction and is very useful in data manipulation</p>

In [43]:
data = pd.read_csv('data/spy.csv', index_col=0, parse_dates=True)
data.head()

                 Open       High         Low     Close   Adj Close    Volume
Date
1999-12-31  146.84375  147.50000  146.250000  146.8750  100.376900   3172700
2000-01-03  148.25000  148.25000  143.875000  145.4375   99.394493   8164300
2000-01-04  143.53125  144.06250  139.640625  139.7500   95.507530   8089800
2000-01-05  139.93750  141.53125  137.250000  140.0000   95.678391  12177900
2000-01-06  139.62500  141.50000  137.750000  137.7500   94.140717   6227200

In [44]:
data[['Volume']].groupby(data.index.year).sum().head()

           Volume
Date
1999      3172700
2000   1931577800
2001   3420728000
2002   8516467700
2003  10303214100

In [45]:
data.groupby(data.index.year).sum().head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
1999,146.843750,147.500000,146.250000,146.875000,100.376900,3172700
2000,36071.187500,36380.750000,35696.171875,36023.859375,24721.091171,1931577800
2001,29699.775635,29960.145607,29415.693764,29700.633141,20606.366402,3420728000
2002,25159.760002,25406.529968,24889.209976,25143.649940,17677.005070,8516467700
2003,24413.080002,24590.909973,24236.430023,24430.370018,17474.746273,10303214100


<h3 id="Pivot-Tables">Pivot Tables<a class="anchor-link" href="#Pivot-Tables">¶</a></h3><p>Pivot table is a similar operation seen in spreadsheets that operate on tabular data and can be performed on multidimension.</p>

In [46]:
pd.pivot_table(data=data, index = data.index.year, values='Volume', aggfunc=sum).head()

           Volume
Date
1999      3172700
2000   1931577800
2001   3420728000
2002   8516467700
2003  10303214100

In [47]:
pd.pivot_table(data=data, index = [data.index.year, data.index.month], values='Volume', aggfunc=sum).head(13)

              Volume
Date Date
1999 12      3172700
2000 1     156770800
     2     186938300
     3     247594900
     4     229246200
     5     161024000
     6     127146000
     7     106780100
     8     102365500
     9     113203000
     10    178392400
     11    156699900
     12    165416700


<h2 id="Filtering">Filtering<a class="anchor-link" href="#Filtering">¶</a></h2><p>Let's now slice and filter close prices above/below certain values.</p>

In [48]:
# Filter dates on which close price above 300
data[data['Close']>300]['Close']

Date
2019-07-12    300.649994
2019-07-15    300.750000
2019-07-23    300.029999
2019-07-24    301.440002
2019-07-26    302.010010
2019-07-29    301.459991
2019-07-30    300.720001
2019-09-11    300.250000
2019-09-12    301.290009
2019-09-13    301.089996
2019-09-16    300.160004
2019-09-17    300.920013
2019-09-18    301.100006
2019-09-19    301.079987
2019-10-24    300.369995
2019-10-25    301.600006
2019-10-28    303.299988
2019-10-29    303.209991
2019-10-30    304.140015
2019-10-31    303.329987
2019-11-01    306.140015
2019-11-04    307.369995
2019-11-05    307.029999
2019-11-06    307.100006
2019-11-07    308.179993
2019-11-08    308.940002
2019-11-11    308.350006
2019-11-12    309.000000
2019-11-13    309.100006
2019-11-14    309.549988
                 ...
2020-01-21    331.299988
2020-01-22    331.339996
2020-01-23    331.720001
2020-01-24    328.769989
2020-01-27    323.500000
2020-01-28    326.890015
2020-01-29    326.619995
2020-01-30    327.679993
2020-01-31    321.730011
2020-02-03    324.119995
2020-02-04    329.059998
2020-02-05    332.859985
2020-02-06    333.980011
2020-02-07    332.200012
2020-02-10    334.679993
2020-02-11    335.260010
2020-02-12    337.420013
2020-02-13    337.059998
2020-02-14    337.600006
2020-02-18    336.730011
2020-02-19    338.339996
2020-02-20    336.950012
2020-02-21    333.480011
2020-02-24    322.420013
2020-02-25    312.649994
2020-02-26    311.500000
2020-03-02    309.089996
2020-03-03    300.239990
2020-03-04    312.859985
2020-03-05    302.459991
Name: Close, Length: 103, dtype: float64

In [49]:
# Filter Open = High
data[data['Open']== data['High']].count()

Open         37
High         37
Low          37
Close        37
Adj Close    37
Volume       37
dtype: int64

In [50]:
df1 = data.copy()
df1.loc[df1['Open'] == df1['High'], 'O=H'] = -1
df1.loc[df1['Open'] == df1['Low'], 'O=L'] = 1
df1.fillna(0,inplace=True)

In [55]:
df1.head()

,Open,High,Low,Close,Adj Close,Volume,O=H,O=L,CHG
Date,,,,,,,,,
1999-12-31,146.84375,147.50000,146.250000,146.8750,100.376900,3172700,0.0,0.0,0.021281
2000-01-03,148.25000,148.25000,143.875000,145.4375,99.394493,8164300,-1.0,0.0,-1.897133
2000-01-04,143.53125,144.06250,139.640625,139.7500,95.507530,8089800,0.0,0.0,-2.634444
2000-01-05,139.93750,141.53125,137.250000,140.0000,95.678391,12177900,0.0,0.0,0.044663
2000-01-06,139.62500,141.50000,137.750000,137.7500,94.140717,6227200,0.0,0.0,-1.342883

In [52]:
# Add new column 
df1['CHG'] = 100*(df1['Close'].sub(df1['Open']))/df1['Open']

In [53]:
# O = L
df1[df1['O=L']==1]['CHG'].sum()

36.52470815125877

In [54]:
# O = H
df1[df1['O=H']==-1]['CHG'].sum()

-48.43308471630347


<h2 id="File-Input-&amp;-Output-with-Arrays">File Input &amp; Output with Arrays<a class="anchor-link" href="#File-Input-&amp;-Output-with-Arrays">¶</a></h2><p>Accessing data is the first step in any data analysis. Pandas features a number of function for reading tabular data as a DataFrame object.</p>
<p>The pandas I/O API is a set of top level reader functions accessed like pandas.read_csv() that generally return a pandas object. The corresponding writer functions are object methods that are accessed like DataFrame.to_csv(). The table below show some of the key parsing functions.</p>
<table>
<thead><tr>
<th>Format</th>
<th>Description</th>
<th>Reader</th>
<th>Writer</th>
</tr>
</thead>
<tbody>
<tr>
<td>text</td>
<td>CSV</td>
<td>read_csv</td>
<td>to_csv</td>
</tr>
<tr>
<td>text</td>
<td>HTML</td>
<td>read_html</td>
<td>to_html</td>
</tr>
<tr>
<td>xls or xlsx</td>
<td>MS Excel</td>
<td>read_excel</td>
<td>to_excel</td>
</tr>
<tr>
<td>binary</td>
<td>Pickle</td>
<td>read_pickle</td>
<td>to_pickle</td>
</tr>
<tr>
<td>sql</td>
<td>SQL</td>
<td>read_sql</td>
<td>to_sql</td>
</tr>
</tbody>
</table>

In [56]:
# Reading a csv file
data = pd.read_csv('data/spy.csv', index_col=0, parse_dates=True)
data.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2020-04-23,280.489990,283.940002,278.750000,279.079987,279.079987,104709700
2020-04-24,280.730011,283.700012,278.500000,282.970001,282.970001,85166000
2020-04-27,285.119995,288.269989,284.619995,287.049988,287.049988,77896600
2020-04-28,291.019989,291.399994,285.399994,285.730011,285.730011,105270000
2020-04-29,291.529999,294.880005,290.410004,293.209991,293.209991,118745600

In [59]:
# Reading an Excel file
# data = pd.read_excel('data/mystocks.xlsx',  sheet_name='AMZN', index_col=0, parse_dates=True)
# data.tail()

In [ ]:
# Writer functions
# data.to_csv(), data.to_excel


<h1 id="References">References<a class="anchor-link" href="#References">¶</a></h1><ul>
<li><p>Pandas documentation <a href="https://pandas.pydata.org/docs/">https://pandas.pydata.org/docs/</a></p>
</li>
<li><p>Jake VanderPlas (2016), Python Data Science Handbook: Essential tools for working with data</p>
</li>
<li><p>McKinney (2018), Python for Data Analysis: Data Wrangling with Pandas, NumPy, and IPython</p>